Revit 2024 API
FillGrid.CalculateLinesPerLength Method
 Calculates the number of solid lines of the pattern per unit length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public double CalculateLinesPerLength()
Visual Basic
Public Function CalculateLinesPerLength As Double
Visual C++
public:
double CalculateLinesPerLength()
Return Value
 The solid lines per length.
See Also
FillGrid Class
Autodesk.Revit.DB Namespace